; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)          
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l21_p21_c21_g21_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate medicine crate2)
	(content-crate medicine crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(person-at person1 loc21)
	(person-at person2 loc18)
	(person-at person3 loc1)
	(person-at person4 loc13)
	(person-at person5 loc7)
	(person-at person6 loc4)
	(person-at person7 loc3)
	(person-at person8 loc12)
	(person-at person9 loc17)
	(person-at person10 loc17)
	(person-at person11 loc15)
	(person-at person12 loc12)
	(person-at person13 loc5)
	(person-at person14 loc20)
	(person-at person15 loc18)
	(person-at person16 loc8)
	(person-at person17 loc16)
	(person-at person18 loc2)
	(person-at person19 loc7)
	(person-at person20 loc19)
	(person-at person21 loc18)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person2 medicine)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 medicine)
	(has-content-person person8 medicine)
	(has-content-person person9 medicine)
	(has-content-person person10 medicine)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
	(has-content-person person13 medicine)
	(has-content-person person14 medicine)
	(has-content-person person15 medicine)
	(has-content-person person16 medicine)
	(has-content-person person17 medicine)
	(has-content-person person18 medicine)
	(has-content-person person19 medicine)
	(has-content-person person20 food)
	(has-content-person person20 medicine)
	(has-content-person person21 medicine)
))
)

; plan
1. (pick-up-crate crate21 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate21 depot)
   added: (has-crate-drone-arm drone1 right crate21)
   goals met: 1 of 22
2. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate1 depot)
   added: (has-crate-drone-arm drone1 left crate1)
   goals met: 1 of 22
3. (drone-move depot loc19 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc19)
   goals met: 0 of 22
4. (drop-crate loc19 person20 crate1 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate1)
   added: (has-content-person person20 food) (empty-arm drone1 left)
   goals met: 1 of 22
5. (drop-crate loc19 person20 crate21 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate21)
   added: (has-content-person person20 medicine) (empty-arm drone1 right)
   goals met: 2 of 22
6. (drone-move loc19 depot drone1)
   deleted: (drone-at drone1 loc19)
   added: (drone-at drone1 depot)
   goals met: 3 of 22
7. (pick-up-crate crate20 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate20 depot)
   added: (has-crate-drone-arm drone1 right crate20)
   goals met: 3 of 22
8. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 2 of 22
9. (drop-crate loc20 person14 crate20 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate20)
   added: (has-content-person person14 medicine) (empty-arm drone1 right)
   goals met: 3 of 22
10. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 4 of 22
11. (pick-up-crate crate19 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate19 depot)
   added: (has-crate-drone-arm drone1 right crate19)
   goals met: 4 of 22
12. (drone-move depot loc16 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc16)
   goals met: 3 of 22
13. (drop-crate loc16 person17 crate19 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate19)
   added: (has-content-person person17 medicine) (empty-arm drone1 right)
   goals met: 4 of 22
14. (drone-move loc16 depot drone1)
   deleted: (drone-at drone1 loc16)
   added: (drone-at drone1 depot)
   goals met: 5 of 22
15. (pick-up-crate crate18 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate18 depot)
   added: (has-crate-drone-arm drone1 right crate18)
   goals met: 5 of 22
16. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 4 of 22
17. (drop-crate loc15 person11 crate18 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate18)
   added: (has-content-person person11 medicine) (empty-arm drone1 right)
   goals met: 5 of 22
18. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 6 of 22
19. (pick-up-crate crate17 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate17 depot)
   added: (has-crate-drone-arm drone1 right crate17)
   goals met: 6 of 22
20. (drone-move depot loc13 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc13)
   goals met: 5 of 22
21. (drop-crate loc13 person4 crate17 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate17)
   added: (has-content-person person4 medicine) (empty-arm drone1 right)
   goals met: 6 of 22
22. (drone-move loc13 depot drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 depot)
   goals met: 7 of 22
23. (pick-up-crate crate16 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate16 depot)
   added: (has-crate-drone-arm drone1 right crate16)
   goals met: 7 of 22
24. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 6 of 22
25. (drop-crate loc8 person16 crate16 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate16)
   added: (has-content-person person16 medicine) (empty-arm drone1 right)
   goals met: 7 of 22
26. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 8 of 22
27. (pick-up-crate crate15 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate15 depot)
   added: (has-crate-drone-arm drone1 right crate15)
   goals met: 8 of 22
28. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 7 of 22
29. (drop-crate loc5 person13 crate15 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate15)
   added: (has-content-person person13 medicine) (empty-arm drone1 right)
   goals met: 8 of 22
30. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 9 of 22
31. (pick-up-crate crate14 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate14 depot)
   added: (has-crate-drone-arm drone1 right crate14)
   goals met: 9 of 22
32. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 8 of 22
33. (drop-crate loc4 person6 crate14 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate14)
   added: (has-content-person person6 medicine) (empty-arm drone1 right)
   goals met: 9 of 22
34. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 10 of 22
35. (pick-up-crate crate13 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate13 depot)
   added: (has-crate-drone-arm drone1 right crate13)
   goals met: 10 of 22
36. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 9 of 22
37. (drop-crate loc3 person7 crate13 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate13)
   added: (has-content-person person7 medicine) (empty-arm drone1 right)
   goals met: 10 of 22
38. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 11 of 22
39. (pick-up-crate crate12 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate12 depot)
   added: (has-crate-drone-arm drone1 right crate12)
   goals met: 11 of 22
40. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 10 of 22
41. (drop-crate loc2 person18 crate12 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate12)
   added: (has-content-person person18 medicine) (empty-arm drone1 right)
   goals met: 11 of 22
42. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 12 of 22
43. (pick-up-crate crate11 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate11 depot)
   added: (has-crate-drone-arm drone1 right crate11)
   goals met: 12 of 22
44. (drone-move depot loc1 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc1)
   goals met: 11 of 22
45. (drop-crate loc1 person3 crate11 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate11)
   added: (has-content-person person3 medicine) (empty-arm drone1 right)
   goals met: 12 of 22
46. (drone-move loc1 depot drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 depot)
   goals met: 13 of 22
47. (pick-up-crate crate10 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate10 depot)
   added: (has-crate-drone-arm drone1 right crate10)
   goals met: 13 of 22
48. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate9 depot)
   added: (has-crate-drone-arm drone1 left crate9)
   goals met: 13 of 22
49. (drone-move depot loc18 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc18)
   goals met: 12 of 22
50. (drop-crate loc18 person2 crate9 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate9)
   added: (has-content-person person2 medicine) (empty-arm drone1 left)
   goals met: 13 of 22
51. (drop-crate loc18 person15 crate10 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate10)
   added: (has-content-person person15 medicine) (empty-arm drone1 right)
   goals met: 14 of 22
52. (drone-move loc18 depot drone1)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 depot)
   goals met: 15 of 22
53. (pick-up-crate crate8 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate8 depot)
   added: (has-crate-drone-arm drone1 right crate8)
   goals met: 15 of 22
54. (drone-move depot loc18 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc18)
   goals met: 14 of 22
55. (drop-crate loc18 person21 crate8 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate8)
   added: (has-content-person person21 medicine) (empty-arm drone1 right)
   goals met: 15 of 22
56. (drone-move loc18 depot drone1)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 depot)
   goals met: 16 of 22
57. (pick-up-crate crate7 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate7 depot)
   added: (has-crate-drone-arm drone1 right crate7)
   goals met: 16 of 22
58. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate6 depot)
   added: (has-crate-drone-arm drone1 left crate6)
   goals met: 16 of 22
59. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 15 of 22
60. (drop-crate loc17 person9 crate6 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate6)
   added: (has-content-person person9 medicine) (empty-arm drone1 left)
   goals met: 16 of 22
61. (drop-crate loc17 person10 crate7 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate7)
   added: (has-content-person person10 medicine) (empty-arm drone1 right)
   goals met: 17 of 22
62. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 18 of 22
63. (pick-up-crate crate5 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate5 depot)
   added: (has-crate-drone-arm drone1 right crate5)
   goals met: 18 of 22
64. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate4 depot)
   added: (has-crate-drone-arm drone1 left crate4)
   goals met: 18 of 22
65. (drone-move depot loc12 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc12)
   goals met: 17 of 22
66. (drop-crate loc12 person8 crate4 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate4)
   added: (has-content-person person8 medicine) (empty-arm drone1 left)
   goals met: 18 of 22
67. (drop-crate loc12 person12 crate5 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate5)
   added: (has-content-person person12 medicine) (empty-arm drone1 right)
   goals met: 19 of 22
68. (drone-move loc12 depot drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 depot)
   goals met: 20 of 22
69. (pick-up-crate crate3 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate3 depot)
   added: (has-crate-drone-arm drone1 right crate3)
   goals met: 20 of 22
70. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 depot)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 20 of 22
71. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 19 of 22
72. (drop-crate loc7 person5 crate2 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person5 medicine) (empty-arm drone1 left)
   goals met: 20 of 22
73. (drop-crate loc7 person19 crate3 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate3)
   added: (has-content-person person19 medicine) (empty-arm drone1 right)
   goals met: 21 of 22
74. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 22 of 22
